{"class_name": "Model", "keras_version": "2.2.4", "config": {"input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, 500], "dtype": "float32"}}, {"name": "input_2", "class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "name": "input_2", "batch_input_shape": [null, 50], "dtype": "float32"}}, {"name": "embedding_1", "class_name": "Embedding", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "embedding_1", "input_dim": 5002, "batch_input_shape": [null, null], "dtype": "float32", "input_length": null, "trainable": true, "embeddings_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "activity_regularizer": null, "embeddings_constraint": null, "output_dim": 128, "mask_zero": false}}, {"name": "embedding_2", "class_name": "Embedding", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"name": "embedding_2", "input_dim": 2001, "batch_input_shape": [null, null], "dtype": "float32", "input_length": null, "trainable": true, "embeddings_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "activity_regularizer": null, "embeddings_constraint": null, "output_dim": 128, "mask_zero": false}}, {"name": "lstm_1", "class_name": "LSTM", "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "config": {"name": "lstm_1", "return_sequences": false, "unroll": false, "go_backwards": false, "kernel_constraint": null, "activation": "tanh", "bias_regularizer": null, "return_state": false, "use_bias": true, "units": 128, "kernel_regularizer": null, "trainable": true, "recurrent_dropout": 0.0, "dropout": 0.0, "bias_constraint": null, "recurrent_constraint": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "implementation": 1, "stateful": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid"}}, {"name": "lstm_2", "class_name": "LSTM", "inbound_nodes": [[["embedding_2", 0, 0, {}]]], "config": {"name": "lstm_2", "return_sequences": false, "unroll": false, "go_backwards": false, "kernel_constraint": null, "activation": "tanh", "bias_regularizer": null, "return_state": false, "use_bias": true, "units": 128, "kernel_regularizer": null, "trainable": true, "recurrent_dropout": 0.0, "dropout": 0.0, "bias_constraint": null, "recurrent_constraint": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "implementation": 1, "stateful": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid"}}, {"name": "concatenate_1", "class_name": "Concatenate", "inbound_nodes": [[["lstm_1", 0, 0, {}], ["lstm_2", 0, 0, {}]]], "config": {"name": "concatenate_1", "trainable": true, "axis": -1}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"units": 2001, "kernel_regularizer": null, "name": "dense_1", "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "softmax", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}], "output_layers": [["dense_1", 0, 0]]}, "backend": "tensorflow"}