{"class_name": "Model", "backend": "tensorflow", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 500], "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "input_2", "class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 50], "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "embedding_1", "class_name": "Embedding", "config": {"output_dim": 128, "name": "embedding_1", "batch_input_shape": [null, null], "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "mask_zero": false, "trainable": true, "input_dim": 5002, "dtype": "float32", "activity_regularizer": null, "embeddings_constraint": null, "input_length": null, "embeddings_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "embedding_2", "class_name": "Embedding", "config": {"output_dim": 128, "name": "embedding_2", "batch_input_shape": [null, null], "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "mask_zero": false, "trainable": true, "input_dim": 2001, "dtype": "float32", "activity_regularizer": null, "embeddings_constraint": null, "input_length": null, "embeddings_regularizer": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "lstm_1", "class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "bias_constraint": null, "kernel_constraint": null, "return_state": false, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "stateful": false, "bias_regularizer": null, "unit_forget_bias": true, "return_sequences": false, "recurrent_dropout": 0.0, "dropout": 0.0, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "activity_regularizer": null, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "implementation": 1, "units": 128, "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "lstm_2", "class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "bias_constraint": null, "kernel_constraint": null, "return_state": false, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "stateful": false, "bias_regularizer": null, "unit_forget_bias": true, "return_sequences": false, "recurrent_dropout": 0.0, "dropout": 0.0, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "activity_regularizer": null, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "implementation": 1, "units": 128, "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"axis": -1, "name": "concatenate_1", "trainable": true}, "inbound_nodes": [[["lstm_1", 0, 0, {}], ["lstm_2", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "units": 2001, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}], "output_layers": [["dense_1", 0, 0]]}, "keras_version": "2.2.4"}